import { DataListPropsType } from '../../components/dataList/DataList';

export const DataListMain: DataListPropsType = {
  header: `Основные инструменты проекта`,
  listData: [
    'React и react-dom: Ключевые библиотеки, используемые для создания пользовательских интерфейсов.',
    'React-router-dom: Библиотека, предназначенная для организации маршрутизации в приложении, позволяя пользователям легко перемещаться между различными страницами.',
    'Vite: Сборщик, обеспечивающий высокую скорость разработки и сборки проекта, что позволяет эффективно работать над приложением.',
    'Antd: Компонентная библиотека, предлагающая современный и эстетически привлекательный интерфейс, что улучшает визуальное восприятие приложения.',
    'TypeScript : надмножество JavaScript, которое добавляет статическую типизацию и улучшает разработку, обеспечивая более строгую проверку кода во время компиляции',
    'Codemirror: Компонент для интеграции CodeMirror в приложение, обеспечивает визуализацию примеров кода.',
  ],
};
